API_CONFIG = {
    "API_URL": "https://api-key.fusionbrain.ai/",
    "API_KEY": "8AF886A5D68CEB8B4263A24D76B3B6A3",
    "SECRET_KEY": "DB4FB8D7263008BD65BEB0367F9D0A9E",
    "LOGO_PATH": "assets//logo.png",
    "LOGO_SIZE": (50, 50)
}

PROFESSIONS = {
    "control_engineer": {
        "name": "Инженер АСУ ТП",
        "background": "Инженер АСУ ТП (автоматизированных систем управления технологическими процессами)  выбирает необходимые датчики, контроллеры, средства связи и другое оборудование для реализации системы"
    },
    "robotics_engineer": {
        "name": "Инженер-робототехник",
        "background": "профессия инженер-робототехник, она стоит на предприятии и в данный момент проектирует и обслуживает робота "
    },
    "software_engineer": {
        "name": "Инженер-программист",
        "background": "профессия инженер-программист, в руках ноутбук на котором она пишет код и она стоит сидит в офисе"
    },
    "ai_specialist": {
        "name": "Cпециалист по искусственному интеллекту",
        "background": "профессия специалист по искусственному интеллекту занимается программированием на своем ноутбуке разработкой, тестированием и внедрением программ и систем, использующих алгоритмы искусственного интеллекта"
    }
}

COLOR_PALETTE = {
    "hair_colors": {
        "blonde": "#F5E6C4",
        "light_brown": "#B57A4F",
        "brown": "#5A3825",
        "red": "#A53A2E"
    },
    "eye_colors": {
        "blue": "#87CEEB",
        "green": "#2E8B57",
        "brown": "#654321"
    },
    "skin_colors": {
        "light": "#FFDBAC",
        "medium": "#E5BA8F",
        "dark": "#C68642"
    }
}